Project/Toir/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/торо_НарядНаВыполнениеРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  <basedOn>Document.торо_ЗаявкаНаРемонт</basedOn>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВыполняемыеРемонтныеРаботы</registerRecords>
  <registerRecords>AccumulationRegister.торо_ПроцентВыполненныхРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>AccumulationRegister.торо_ЗапланированныеРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_НарядыПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявокУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовНарядовНаРемонтныеРаботыУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовНарядовНаРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовЗаявок</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_РежимРаботы</name>
    <type>
      <types>EnumRef.гкс_РежимРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОсобыеУсловия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОформитьНарядДопуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОпаснаяРабота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПроведенияРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорБригада</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.торо_РемонтныеБригады</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Огневая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ПовКоэф</name>
      <type>
        <types>CatalogRef.гкс_ПКоэффициентыРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрываемыеПредписания</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзДокументаОснования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВнешнегоОснования</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>гкс_СотрудникКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПодрядчики</name>
    <comment>Заменена на ТЧ ИсполнителиПоРемонтам</comment>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственноеЛицо</name>
      <type>
        <types>EnumRef.торо_ОтветственныеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсполнителиПоРемонтам</name>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>УточнениеИсполнителя</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.торо_РемонтныеБригады</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_МПОБДо</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_МПОБВоВремя</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/CommonForms/торо_ФормаОперацийБезНарядов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
&НаКлиенте
Перем СозданыАкты;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокОснование") Тогда
		ДокОснование = Параметры.ДокОснование;
	КонецЕсли;
	
	Если Параметры.Свойство("ТабОперацийБезНаряда") Тогда
		
		ТабОперацийБезНаряда = Параметры.ТабОперацийБезНаряда.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Таб.ВводитьНаряд,
		|	Таб.ОбъектРемонта,
		|	Таб.ВидРемонта,
		|	Таб.РемонтнаяРабота,
		|	Таб.ДатаНачалаРемонта,
		|	Таб.ДатаОкончанияРемонта,
		|	Таб.ID
		|ПОМЕСТИТЬ ТабОперацийБезНаряда
		|ИЗ
		|	&ТабОперацийБезНаряда КАК Таб
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабОперацийБезНаряда.ВводитьНаряд,
		|	ТабОперацийБезНаряда.ОбъектРемонта КАК ОбъектРемонта,
		|	ТабОперацийБезНаряда.ВидРемонта КАК ВидРемонта,
		|	ТабОперацийБезНаряда.РемонтнаяРабота,
		|	ТабОперацийБезНаряда.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
		|	ТабОперацийБезНаряда.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
		|	ТабОперацийБезНаряда.ID
		|ИЗ
		|	ТабОперацийБезНаряда КАК ТабОперацийБезНаряда
		|ИТОГИ ПО
		|	ОбъектРемонта,
		|	ДатаНачалаРемонта,
		|	ВидРемонта";
		
		Запрос.УстановитьПараметр("ТабОперацийБезНаряда", ТабОперацийБезНаряда);
		Результат = Запрос.Выполнить();
		ВыборкаОбъектРемонта = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Дерево = РеквизитФормыВЗначение("РемонтныеРаботы");
		
		Пока ВыборкаОбъектРемонта.Следующий() Цикл
			
			НоваяСтрока = Дерево.Строки.Добавить();
			НоваяСтрока.Объект = ВыборкаОбъектРемонта.ОбъектРемонта;
			
			ВыборкаДатаНачала = ВыборкаОбъектРемонта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДатаНачала.Следующий() Цикл
								
				ВыборкаВидРемонта = ВыборкаДатаНачала.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаВидРемонта.Следующий() Цикл
					НС = НоваяСтрока.Строки.Добавить();
					НС.Объект = ВыборкаВидРемонта.ВидРемонта;
					
					ВыборкаДетЗаписи = ВыборкаВидРемонта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаДетЗаписи.Следующий() Цикл
						
						НС.ДатаНачала = ВыборкаДетЗаписи.ДатаНачалаРемонта;
						НС.ДатаОкончания = ВыборкаДетЗаписи.ДатаОкончанияРемонта;
						
						НовСтр = НС.Строки.Добавить();
						НовСтр.Объект = ВыборкаДетЗаписи.РемонтнаяРабота;	
						НовСтр.ID = ВыборкаДетЗаписи.ID;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(Дерево, "РемонтныеРаботы");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Развернуть(Команды.Развернуть);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не СозданыАкты Тогда
		ТекстСообщения = НСтр("es='Es imposible crear ""el Acta sobre la ejecución de la etapa de los trabajos"" ya que el documento-razón contiene las reparaciones a los trabajos del peligro subido. ¡Es necesario obligatoriamente introducir el documento ""el Vestido de la ejecución de los trabajos de reparación""!';ru='Невозможно создать ""Акт о выполнении этапа работ"" поскольку документ-основание содержит ремонты с работами повышенной опасности. Требуется обязательно ввести документ ""Наряд на выполнение ремонтных работ""!';en='Unable to create an “Act on the implementation of the work phase” because the base document contains repairs with hazardous work. It is required to enter the document ""Order for repair work""!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРемонтныеРаботы

&НаКлиенте
Процедура РемонтныеРаботыВыбранПриИзменении(Элемент)
	
	ТекСтрока = Элементы.РемонтныеРаботы.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		ПроставитьГалочкиПоВеткеВниз (ТекСтрока, ТекСтрока.Выбран);
		ПроставитьГалочкиПоВеткеВверх(ТекСтрока, ТекСтрока.Выбран);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВвестиНаряды(Команда)
	
	МассивРемонтов = ВвестиНарядыНаСервере();
	
	Если МассивРемонтов <> Неопределено ИЛИ ИзНормативов = Истина Тогда 
		
		СтруктураПараметров = Новый Структура;
		Основание = Новый Структура;
		Основание.Вставить("Основание", ДокОснование);
		Основание.Вставить("ОпасныеРаботы", Истина);
		Основание.Вставить("ИзНормативов", ИзНормативов);
		Основание.Вставить("РемонтыОборудования", ВыбранныеОперации);
		Основание.Вставить("МассивРемонтов", МассивРемонтов);
		СтруктураПараметров.Вставить("Основание", Основание);
		ОткрытьФорму("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ФормаОбъекта", СтруктураПараметров);
		
		СозданыАкты = Истина;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделение(Команда)
	
	Для каждого Стр Из РемонтныеРаботы.ПолучитьЭлементы() Цикл
		
		Стр.Выбран = Ложь;
		ПроставитьГалочкиПоВеткеВниз (Стр, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	Для каждого Стр Из РемонтныеРаботы.ПолучитьЭлементы() Цикл
		
		Стр.Выбран = Истина;
		ПроставитьГалочкиПоВеткеВниз (Стр, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)	
	Для Каждого ТекСтрока Из РемонтныеРаботы.ПолучитьЭлементы() Цикл
		Элементы.РемонтныеРаботы.Развернуть(ТекСтрока.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	
	Для каждого Стр Из РемонтныеРаботы.ПолучитьЭлементы() Цикл
		
		СвернутьПодчиненные(Стр);
		Элементы.РемонтныеРаботы.Свернуть(Стр.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ВвестиНарядыНаСервере()
	
	Дерево = РеквизитФормыВЗначение("РемонтныеРаботы");
	
	Рез = Дерево.Строки.Найти(Истина, "Выбран", Истина); 
	
	Если Рез <> Неопределено Тогда
		
		Для каждого СтрокаОР Из Дерево.Строки Цикл
			
			Если СтрокаОР.Выбран Тогда
		
				Для каждого СтрокаВР ИЗ СтрокаОР.Строки Цикл
		
					Если СтрокаВР.Выбран Тогда
												
						Для Каждого СтрокаОперации ИЗ СтрокаВР.Строки Цикл
							
							Если СтрокаОперации.Выбран Тогда
								НС = ВыбранныеОперации.Добавить();
								НС.ДатаНачалаРемонта = СтрокаВР.ДатаНачала;
								НС.ДатаОкончанияРемонта = СтрокаВР.ДатаОкончания; 
								НС.ВидРемонта = СтрокаВР.Объект;
								НС.ID = СтрокаОперации.ID;
								НС.РемонтнаяРабота = СтрокаОперации.Объект;
								НС.ОбъектРемонта = СтрокаОР.Объект;
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВыбранныеОперации.Количество() И (ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт")) Тогда
		
			ТабIDИРабот = ВыбранныеОперации.Выгрузить(,"ID, РемонтнаяРабота");
			ТабIDИРабот.Свернуть("ID, РемонтнаяРабота");
			МассивID = ТабIDИРабот.ВыгрузитьКолонку("ID");
			МассивРабот = ТабIDИРабот.ВыгрузитьКолонку("РемонтнаяРабота");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Таб.ID КАК ID,
			|	Таб.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
			|	Таб.РемонтнаяРабота КАК РемонтнаяРабота,
			|	Таб.Родитель_ID КАК Родитель_ID,
			|	Таб.Количество КАК Количество
			|ПОМЕСТИТЬ ТабРемРаб
			|ИЗ
			|	&Таб КАК Таб
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабРемРаб.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
			|	ТабРемРаб.ID КАК ID,
			|	ТабРемРаб.РемонтнаяРабота КАК РемонтнаяРабота,
			|	ТабРемРаб.Родитель_ID КАК Родитель_ID,
			|	ТабРемРаб.Количество КАК Количество
			|ИЗ
			|	ТабРемРаб КАК ТабРемРаб
			|ГДЕ
			|	ТабРемРаб.РемонтыОборудования_ID В(&МассивРемонтыОборудования_ID)
			|		И ТабРемРаб.РемонтнаяРабота В(&МассивРемонтныеРаботы)";
			
			Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Таб.РемонтыОборудования_ID", "Таб.Предписание_ID");
			КонецЕсли;
			
			Запрос.УстановитьПараметр("МассивРемонтыОборудования_ID", МассивID);
			Запрос.УстановитьПараметр("МассивРемонтныеРаботы", МассивРабот);
			Запрос.УстановитьПараметр("Таб", ДокОснование.РемонтныеРаботы);
			
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			
			МассивВозврата = Новый Массив;
			Пока Выборка.Следующий() Цикл
				
				Ремонт = Новый Структура("ID, РемонтыОборудования_ID, РемонтнаяРабота, Родитель_ID, Количество");
				ЗаполнитьЗначенияСвойств(Ремонт, Выборка);
				МассивВозврата.Добавить(Ремонт);
				
			КонецЦикла;
			
			Возврат МассивВозврата;
		ИначеЕсли ВыбранныеОперации.Количество() И (ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ПланГрафикРемонта")) Тогда
			
			ИзНормативов = Истина;
			Возврат Неопределено;			
			
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения = НСтр("es='¡No es escogido ni una reparación!';ru='Не выбран ни один ремонт!';en='No repair selected!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПроставитьГалочкиПоВеткеВниз(СтрокаДерева, ЗначГалки)
	
	Для Каждого Элем Из СтрокаДерева.ПолучитьЭлементы() Цикл
		
		Элем.Выбран = ЗначГалки;
		ПроставитьГалочкиПоВеткеВниз(Элем, ЗначГалки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьГалочкиПоВеткеВверх(СтрокаДерева, ЗначГалки)
	
	СтрРодитель = СтрокаДерева.ПолучитьРодителя();
	
	Если СтрРодитель <> Неопределено И НЕ СтрРодитель.Выбран Тогда 
		
		СтрРодитель.Выбран = ЗначГалки;
		ПроставитьГалочкиПоВеткеВверх(СтрРодитель, ЗначГалки);
		
	КонецЕсли;
	
		СтрокаДерева.Выбран = ЗначГалки;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПодчиненные(Строка)
	
	Для каждого Стр Из Строка.ПолучитьЭлементы() Цикл
		
		СвернутьПодчиненные(Стр);
		Элементы.РемонтныеРаботы.Свернуть(Стр.ПолучитьИдентификатор());
		
	КонецЦикла; 	
	
КонецПроцедуры

#Если Клиент Тогда
	СозданыАкты = Ложь;
#КонецЕсли

#КонецОбласти
